odudex/Kern/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
# 0x10000 gives the bootloader 56KB (0x2000..0x10000): the plain bootloader was 320 bytes
# from the 24KB cap, and the Phase 5 FE / Phase 6 secure boot bootloaders need ~36KB+.
# nvs moved to 0x11000 (shrunk 84->52KB) so otadata/ota_0/ota_1/storage keep their offsets.
CONFIG_PARTITION_TABLE_OFFSET=0x10000
# NVS encryption, HMAC scheme (keys derived from eFuse KEY4, no nvs_keys partition).
# The app never calls nvs_flash_init(): its keygen path would burn KEY4 without
# consent. Boot branches on KEY4 presence in core/nvs_secure.c instead.
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=4
# Phase 4: SD-card updates verify Secure Boot v2 RSA-3072 app signatures
# against the running app's keys (no secure boot eFuses yet). IDF aborts at
# boot if the running app has no signature block, so every build is signed
# with a per-clone throwaway key (auto-generated by CMakeLists.txt,
# gitignored). Releases re-sign the kept kern-unsigned.bin offline with the
# real key (scripts/sign_release.sh).
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
CONFIG_SECURE_BOOT_SIGNING_KEY="dev_signing_key.pem"
# Rollback safety net: new OTA image must self-confirm on first boot
# (fw_update_boot_confirm) or the bootloader returns to the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_VFS_MAX_COUNT=8
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X800_50FPS=n
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1280X960_BINNING_45FPS=y
CONFIG_CAMERA_SC2336=y
CONFIG_CAMERA_SC2336_MIPI_RAW8_1280X720_30FPS=n
CONFIG_CAMERA_SC2336_MIPI_RAW10_1280X720_30FPS=y
CONFIG_CAMERA_SC2336_MIPI_DEFAULT_FMT_RAW10_1280X720_30FPS=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=n
# Kern opens only the MIPI-CSI device; drop the unused DVP driver (defaults on for P4 LCDCAM).
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# LVGL 9.5 hot draw fns overflow the IRAM window if placed there; keep them in cached flash.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
